app/views/rooms/_form.html.erb

                        <label>Accommodates</label>
                        <%= f.select :capacity, [["1 guest", 1], ["2 guests", 2], ["3 guests", 3], ["4 guests", 4], ["5 guests", 5], ["6+ guests", 6]], id: "capacity", prompt: "Select", class: "form-control" %>
---
SELECT "cities".* FROM "cities"

                        <datalist id="countries_autocomplete">
                            <%= City.country_list.each do |country| %>
---
SELECT "cities"."country" FROM "cities"