app/controllers/reservations_controller.rb

  def create
    @reservation = current_user.reservations.new(reservation_params)
    if @reservation.save
---
INSERT INTO "reservations" ("user_id", "room_id", "start_date", "end_date", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def new
    @room = Room.find(params[:room_id])
---
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def index
    @room = Room.find(params[:room_id])
---
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]