app/controllers/reviews_controller.rb

  def create
    @review = @room.reviews.build(review_params)
    @review.user_id = current_user.id
    if @review.save
---
INSERT INTO "reviews" ("content", "room_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "tests\r\n"], ["room_id", 1], ["user_id", 1], ["created_at", "2017-06-21 18:22:08.097836"], ["updated_at", "2017-06-21 18:22:08.097836"]]

  def set_room
    @room = Room.find(params[:room_id])
---
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]