app/controllers/rooms_controller.rb

  def create
    @room = current_user.rooms.build(room_params)
    if @room.save
---
INSERT INTO "rooms" ("home_type", "room_type", "capacity", "bed_rooms", "bath_rooms", "listing_name", "summary", "address", "price", "active", "city_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)