app/controllers/static_controller.rb

SELECT "rooms".* FROM "rooms"
---
  def home
    @rooms = Room.all